Archive/8sem/D_last/app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE (year = 2010) ORDER BY start_date LIMIT 30 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "courses" WHERE (year = 2010) LIMIT 30 OFFSET 0) subquery_for_count
---
  def index
    @courses = Course.find_by_year(session[:choice_year].to_i).page(params[:page])