Archive/8sem/D_last/app/controllers/schoolkids_controller.rb

  def index
  @schoolkid =  Schoolkid.page(params[:page])
    respond_to do |format|
      format.html {
        @groups = Group.includes(:schoolkids).where('year = ?', session[:choice_year]).all
---
SELECT "schoolkids".* FROM "schoolkids" ORDER BY second_name LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "schoolkids"
SELECT "groups".* FROM "groups" WHERE (year = 2012) ORDER BY number
SELECT "schoolkids".* FROM "schoolkids" WHERE "schoolkids"."group_id" IN (1, 2, 3) ORDER BY second_name

  def show
    @schoolkid = Schoolkid.includes(:school_group).find(params[:id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? ORDER BY number LIMIT 1  [["id", 7]]
SELECT "school_groups".* FROM "school_groups" WHERE "school_groups"."id" = ? ORDER BY number LIMIT 1  [["id", 28]]
SELECT "schoolkids".* FROM "schoolkids" WHERE "schoolkids"."id" = ? ORDER BY second_name LIMIT 1  [["id", "13"]]

  def edit
    @schoolkid = Schoolkid.includes(:school_group).find(params[:id])
---
SELECT "school_groups".* FROM "school_groups" WHERE "school_groups"."id" IN (28) ORDER BY number
SELECT "schoolkids".* FROM "schoolkids" WHERE "schoolkids"."id" = ? ORDER BY second_name LIMIT 1  [["id", "6"]]

  def update
    @schoolkid = Schoolkid.find(params[:id])
---
SELECT "schoolkids".* FROM "schoolkids" WHERE "schoolkids"."id" = ? ORDER BY second_name LIMIT 1  [["id", "6"]]