Archive/8sem/D_last/app/views/courses/_form.html.haml

    %br
    =f.select :discipline_id, Discipline.all.map{|d| [d.full_name, d.id]}
  .field
---
SELECT "disciplines".* FROM "disciplines" ORDER BY full_name