Archive/7sem/fdo_project/app/views/layouts/_aside.haml

SELECT "disciplines".* FROM "disciplines" ORDER BY full_name
---
  %ul.box
    -Discipline.all.each do |dis|