Archive/7sem/fdo_project/app/controllers/groups_controller.rb

  def index
    @groups = Group.page(params[:page])
---
SELECT "groups".* FROM "groups" ORDER BY number LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "groups"

  def show
    @group = Group.find(params[:id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 3 ORDER BY number LIMIT 1