Archive/7sem/fdo_project/app/controllers/schoolkids_controller.rb

SELECT "schoolkids".* FROM "schoolkids" ORDER BY second_name LIMIT 40 OFFSET 0
SELECT COUNT(*) FROM "schoolkids"
---
  def index
    @schoolkids = Schoolkid.page(params[:page])